src/InformationRegisters/ЗамерыПроизводительности/ЗамерыПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыПроизводительности</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиЗамерПроизводительности</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗамераUTC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКлючевойОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗамерыПроизводительностиДополнительнаяИнформация/ЗамерыПроизводительностиДополнительнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыПроизводительностиДополнительнаяИнформация</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ЗначенияПараметраЗамера</types>
    </type>
  </resources>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <comment>Уникальный идентификатор записи в регистре сведений ЗамерыПроизводительности</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрыЗамера</name>
    <type>
      <types>CatalogRef.ПараметрыЗамера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗамерыПроизводительности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция УдалитьУстаревшиеДанные(КрайняяДатаЗаписи, УдалитьВсе) Экспорт
    
    ВнутренниеОбъектыКонтроля = Новый Массив;
               
	ЕстьУдаление = Ложь;
	
	Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ ПЕРВЫЕ 1000
    |   ОбъектКонтроля,
    |   ДатаЗамераUTC,
    |   ИдентификаторКлючевойОперации,
    |   НомерСеанса,
    |   УникальныйИдентификаторЗаписи
    |ИЗ
    |   РегистрСведений.ЗамерыПроизводительности
    |ГДЕ
    |   ДатаЗамераUTC < &ГраницаУдаления
    |   {И ОбъектКонтроля В (&ВнутренниеОбъектыКонтроля)}
    |УПОРЯДОЧИТЬ ПО
    |   ДатаЗамераUTC
    |";
    
    Если НЕ УдалитьВсе Тогда
        
        ЦентрКонтроляКачества = Справочники.ОбъектыКонтроля.НайтиПоНаименованию("Центр контроля качества", Истина);
        Если ЦентрКонтроляКачества <> Неопределено Тогда
            ВнутренниеОбъектыКонтроля.Добавить(ЦентрКонтроляКачества);
        КонецЕсли;
        
        ЦентрМониторингаИмпортСсылка = Справочники.ОбъектыКонтроля.НайтиПоНаименованию("Центр мониторинга", Истина);
        Если ЦентрМониторингаИмпортСсылка <> Неопределено Тогда
            ВнутренниеОбъектыКонтроля.Добавить(ЦентрМониторингаИмпортСсылка);
        КонецЕсли;
        
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "{И ОбъектКонтроля В (&ВнутренниеОбъектыКонтроля)}", "И ОбъектКонтроля В (&ВнутренниеОбъектыКонтроля)");
        Запрос.УстановитьПараметр("ВнутренниеОбъектыКонтроля", ВнутренниеОбъектыКонтроля);
    Иначе
        
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "{И ОбъектКонтроля В (&ВнутренниеОбъектыКонтроля)}", "");
        
    КонецЕсли;
    
    Запрос.УстановитьПараметр("ГраницаУдаления", (КрайняяДатаЗаписи - Дата(1,1,1)) * 1000);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        ЕстьУдаление = Истина;
        
        НачатьТранзакцию();
        Попытка
            МенеджерЗаписи = РегистрыСведений.ЗамерыПроизводительности.СоздатьМенеджерЗаписи();
            МенеджерЗаписи.ОбъектКонтроля = Выборка.ОбъектКонтроля;
            МенеджерЗаписи.ДатаЗамераUTC = Выборка.ДатаЗамераUTC;
            МенеджерЗаписи.ИдентификаторКлючевойОперации = Выборка.ИдентификаторКлючевойОперации;
            МенеджерЗаписи.НомерСеанса = Выборка.НомерСеанса;
            МенеджерЗаписи.Удалить();
            
            НаборЗаписей = РегистрыСведений.ЗамерыПроизводительностиДополнительнаяИнформация.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.УникальныйИдентификаторЗаписи.Установить(Выборка.УникальныйИдентификаторЗаписи);
            НаборЗаписей.Записать(Истина);
            
            ЗафиксироватьТранзакцию();
        Исключение
            Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
            ЗаписьЖурналаРегистрации("Удаление замеров производительности", УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
            ОтменитьТранзакцию();
        КонецПопытки;
        
    КонецЦикла;
       
    
    
	Возврат ЕстьУдаление;
	
КонецФункции

#КонецЕсли
